<html><head><title>Moose::Manual::Concepts</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1" >
<link rel="stylesheet" title="blkbluw" type="text/css" href="../_blkbluw.css" media="all" >
<link rel="alternate stylesheet" title="blkmagw" type="text/css" href="../_blkmagw.css" media="all" >
<link rel="alternate stylesheet" title="blkcynw" type="text/css" href="../_blkcynw.css" media="all" >
<link rel="alternate stylesheet" title="whtprpk" type="text/css" href="../_whtprpk.css" media="all" >
<link rel="alternate stylesheet" title="whtnavk" type="text/css" href="../_whtnavk.css" media="all" >
<link rel="alternate stylesheet" title="grygrnk" type="text/css" href="../_grygrnk.css" media="all" >
<link rel="alternate stylesheet" title="whtgrng" type="text/css" href="../_whtgrng.css" media="all" >
<link rel="alternate stylesheet" title="blkgrng" type="text/css" href="../_blkgrng.css" media="all" >
<link rel="alternate stylesheet" title="grygrnw" type="text/css" href="../_grygrnw.css" media="all" >
<link rel="alternate stylesheet" title="blkbluw" type="text/css" href="../_blkbluw.css" media="all" >
<link rel="alternate stylesheet" title="whtpurk" type="text/css" href="../_whtpurk.css" media="all" >
<link rel="alternate stylesheet" title="whtgrng" type="text/css" href="../_whtgrng.css" media="all" >
<link rel="alternate stylesheet" title="grygrnw" type="text/css" href="../_grygrnw.css" media="all" >

<script type="text/javascript" src="../_podly.js"></script>

</head>
<body class='pod'>
<!--
  generated by Pod::Simple::HTML v3.20,
  using Pod::Simple::PullParser v3.20,
  under Perl v5.014002 at Sun Mar 11 06:38:41 2012 GMT.

 If you want to change this HTML document, you probably shouldn't do that
   by changing it directly.  Instead, see about changing the calling options
   to Pod::Simple::HTML, and/or subclassing Pod::Simple::HTML,
   then reconverting this document from the Pod source.
   When in doubt, email the author of Pod::Simple::HTML for advice.
   See 'perldoc Pod::Simple::HTML' for more info.

-->

<!-- start doc -->
<p class="backlinktop"><b><a name="___top" href="../index.html" accesskey="1" title="All Documents">&lt;&lt;</a></b></p>

<div class='indexgroup'>
<ul   class='indexList indexList1'>
  <li class='indexItem indexItem1'><a href='#NAME'>NAME</a>
  <li class='indexItem indexItem1'><a href='#VERSION'>VERSION</a>
  <li class='indexItem indexItem1'><a href='#Moose_(19982)_Perl_(26087)(24335)(38754)(21521)(23545)(35937)(30340)(27604)(36739)'>Moose &#19982; Perl &#26087;&#24335;&#38754;&#21521;&#23545;&#35937;&#30340;&#27604;&#36739;</a>
  <ul   class='indexList indexList2'>
    <li class='indexItem indexItem2'><a href='#Class'>Class</a>
    <li class='indexItem indexItem2'><a href='#Attribute'>Attribute</a>
    <li class='indexItem indexItem2'><a href='#Method'>Method</a>
    <li class='indexItem indexItem2'><a href='#Role'>Role</a>
    <li class='indexItem indexItem2'><a href='#Method_modifiers'>Method modifiers</a>
    <li class='indexItem indexItem2'><a href='#Type'>Type</a>
    <li class='indexItem indexItem2'><a href='#Delegation'>Delegation</a>
    <li class='indexItem indexItem2'><a href='#Constructor'>Constructor</a>
    <li class='indexItem indexItem2'><a href='#Destructor'>Destructor</a>
    <li class='indexItem indexItem2'><a href='#Object_instance'>Object instance</a>
    <li class='indexItem indexItem2'><a href='#(24635)(32467)'>&#24635;&#32467;</a>
  </ul>
  <li class='indexItem indexItem1'><a href='#(20160)(20040)(26159)(20803)(31867)(65311)'>&#20160;&#20040;&#26159;&#20803;&#31867;&#65311;</a>
  <li class='indexItem indexItem1'><a href='#BUT_I_NEED_TO_DO_IT_MY_WAY!'>BUT I NEED TO DO IT MY WAY!</a>
  <li class='indexItem indexItem1'><a href='#(25509)(19979)(26469)(20570)(20160)(20040)(65311)'>&#25509;&#19979;&#26469;&#20570;&#20160;&#20040;&#65311;</a>
  <li class='indexItem indexItem1'><a href='#(20316)(32773)'>&#20316;&#32773;</a>
  <li class='indexItem indexItem1'><a href='#(29256)(26435)(21644)(35768)(21487)'>&#29256;&#26435;&#21644;&#35768;&#21487;</a>
</ul>
</div>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="NAME"
>NAME</a></h1>

<p>Moose::Manual::Concepts - Moose &#20851;&#20110;&#38754;&#21521;&#23545;&#35937;&#30340;&#19968;&#20123;&#27010;&#24565;</p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="VERSION"
>VERSION</a></h1>

<p>version 2.0401</p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="Moose_(19982)_Perl_(26087)(24335)(38754)(21521)(23545)(35937)(30340)(27604)(36739)"
>Moose &#19982; Perl &#26087;&#24335;&#38754;&#21521;&#23545;&#35937;&#30340;&#27604;&#36739;</a></h1>

<p>&#20197;&#21069;&#20320;&#21487;&#33021;&#27809;&#26377;&#20180;&#32454;&#30340;&#30740;&#31350;&#36807; package &#21644; class &#12289; attributes &#21644; methods&#12289; constructors &#21644; methods &#31561;&#30340;&#21306;&#21035;&#12290;&#22312; Moose &#20013;&#65292;&#36825;&#20123;&#37117;&#26159;&#26377;&#21508;&#33258;&#30340;&#27010;&#24565;&#30340;&#65292;&#23613;&#31649;&#23427;&#20204;&#37117;&#26159;&#22522;&#20110;&#26222;&#36890;&#30340; Perl &#23454;&#29616;&#30340;&#12290;</p>

<p>&#20803;&#23545;&#35937;&#21327;&#35758;(MOP)&#20026;&#38754;&#21521;&#23545;&#35937;&#20013;&#24120;&#29992;&#30340;&#27010;&#24565;&#25552;&#20379;&#20102;&#33391;&#22909;&#30340;&#33258;&#30465;&#21151;&#33021;&#65292;&#32780; Moose &#21017;&#25552;&#20379;&#35821;&#27861;&#31958;&#12290;Moose &#20063;&#24341;&#36827;&#20102;&#19968;&#20123;&#26032;&#30340;&#27010;&#24565;&#65292;&#27604;&#22914;&#35282;&#33394;&#65288;roles&#65289;,&#26041;&#27861;&#20462;&#39280;&#31526;&#65288;method modifiers&#65289;&#21644;&#22996;&#25176;&#23646;&#24615;&#65288;declarative delegation&#65289;&#12290;</p>

<p>&#30693;&#36947;&#22914;&#20309;&#29992; Moose &#26469;&#34920;&#31034;&#36825;&#20123;&#27010;&#24565;&#65292;&#24182;&#19988;&#21644;&#26087;&#24335;&#30340; Perl &#23454;&#29616;&#36827;&#34892;&#23545;&#27604;&#65292;&#36825;&#26159;&#19968;&#20010;&#27604;&#36739;&#25512;&#33616;&#30340;&#23398;&#20064;&#26041;&#24335;&#12290;</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Class"
>Class</a></h2>

<p>&#24403;&#20320;&#22312; package &#37324;&#20351;&#29992; &#34;use Moose&#34;&#65292;&#36825;&#34920;&#26126;&#20320;&#22312;&#23450;&#20041;&#19968;&#20010;&#31867;&#12290;&#19968;&#20010;&#31616;&#21333;&#30340;&#31867;&#21253;&#25324;&#23646;&#24615;&#21644;&#26041;&#27861;&#12290;&#24403;&#28982;&#23427;&#20063;&#21487;&#20197;&#21253;&#21547;&#35282;&#33394;&#12289;&#26041;&#27861;&#20462;&#39280;&#31526;&#31561;&#31561;&#12290;</p>

<p>&#19968;&#20010;&#31867;<i>&#26377;</i>&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;<b>&#23646;&#24615;</b>&#12290;</p>

<p>&#19968;&#20010;&#31867;<i>&#26377;</i>&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;<b>&#26041;&#27861;</b>&#12290;</p>

<p>&#19968;&#20010;&#31867;<i>&#26377;</i>&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;&#29238;&#31867;&#12290;&#23427;&#32487;&#25215;&#23427;&#25152;&#26377;&#30340;&#29238;&#31867;&#12290;</p>

<p>&#19968;&#20010;&#31867;<i>&#26377;</i>&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;<b>&#26041;&#27861;&#20462;&#39280;&#31526;</b>&#12290;&#36825;&#20123;&#20462;&#39280;&#31526;&#21487;&#20197;&#20316;&#29992;&#20110;&#33258;&#24049;&#30340;&#26041;&#27861;&#25110;&#32773;&#26159;&#20174;&#29238;&#31867;&#32487;&#25215;&#36807;&#26469;&#30340;&#26041;&#27861;&#12290;</p>

<p>&#19968;&#20010;&#31867;<i>&#33021;</i>&#20805;&#24403;&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;<b>&#35282;&#33394;</b>&#12290;</p>

<p>&#19968;&#20010;&#31867;<i>&#26377;</i>&#19968;&#20010;<b>&#26500;&#36896;&#20989;&#25968;</b>&#21644;&#19968;&#20010;<b>&#26512;&#26500;&#20989;&#25968;</b>&#12290;Moose &#20026;&#20320;&#40664;&#35748;&#25552;&#20379;&#12290;</p>

<p><b>&#26500;&#36896;&#20989;&#25968;</b>&#25509;&#21463;&#30456;&#24212;&#30340;&#21629;&#21517;&#21442;&#25968;&#24182;&#29992;&#23427;&#20204;&#26469;&#21021;&#22987;&#21270;<b>&#23545;&#35937;&#30340;&#23454;&#20363;</b>&#12290;</p>

<p>&#19968;&#20010;&#31867;<i>&#26377;</i>&#19968;&#20010;<b>&#20803;&#31867;</b>&#65292;&#21516;&#26102;&#20063;&#23601;&#26377;<b>&#20803;&#31867;&#23646;&#24615;</b>&#65292;<b>&#20803;&#31867;&#26041;&#27861;</b>&#65292;<b>&#20803;&#31867;&#35282;&#33394;</b>&#12290;&#36825;&#20010;&#20803;&#31867;<i>&#25551;&#36848;</i>&#30528;&#36825;&#20010;&#31867;&#12290;</p>

<p>&#19968;&#20010;&#31867;&#36890;&#24120;&#26159;&#19968;&#20010;&#31867;&#21035;&#30340;&#25110;&#30456;&#20284;&#31867;&#21035;&#30340;&#21517;&#23383;&#65292;&#22914;&#34;People&#34;&#12289;&#34;Users&#34;&#12290;</p>

<pre>  package Person;

  use Moose;
  # now it&#39;s a Moose class!</pre>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Attribute"
>Attribute</a></h2>

<p>&#23646;&#24615;&#26159;&#26469;&#23450;&#20041;&#23427;&#30340;&#31867;&#30340;&#23646;&#24615;&#12290;&#23427;<i>&#24635;&#26377;</i>&#19968;&#20010;&#21517;&#31216;&#65292;&#23427;<i>&#21487;&#33021;</i>&#36824;&#20855;&#26377;&#19968;&#20123;&#20854;&#20182;&#23646;&#24615;&#12290;</p>

<p>&#36825;&#20123;&#23646;&#24615;&#21487;&#20197;&#21253;&#21547;&#35835;/&#20889;&#26631;&#24535;&#65292;<b>&#31867;&#22411;</b>&#20449;&#24687;&#65292;&#35775;&#38382;&#22120;&#26041;&#27861;&#65292;<b>&#22996;&#25176;&#26041;&#27861;</b>&#65292;&#40664;&#35748;&#20540;&#31561;&#31561;&#12290;</p>

<p>&#23646;&#24615;&#19981;&#26159;&#26041;&#27861;&#12290;&#32780;&#26159;&#35201;&#21019;&#24314;&#21508;&#31181;&#23384;&#21462;&#26041;&#27861;&#30340;&#21407;&#22240;&#12290;&#33267;&#23569;&#65292;&#19968;&#20010;&#27491;&#24120;&#30340;&#23646;&#24615;&#23558;&#26377;&#19968;&#20010;&#35835;&#32773;&#30340;&#35775;&#38382;&#26041;&#27861;&#12290;&#35768;&#22810;&#23646;&#24615;&#26377;&#20854;&#20182;&#26041;&#27861;&#65292;&#22914;&#19968;&#20010;&#20889;&#32773;&#30340;&#26041;&#27861;&#65292;&#19968;&#20010;&#28165;&#31354;&#26041;&#27861;&#65292;&#19968;&#20010;&#27979;&#35797;&#26041;&#27861;&#65288;&#22914;&#36825;&#20010;&#23646;&#24615;&#34987;&#35774;&#32622;&#20102;&#21527;&#65311;&#65289;&#31561;&#31561;&#12290;</p>

<p>&#23646;&#24615;&#20063;&#21487;&#20197;&#23450;&#20041;<b>&#22996;&#25176;&#23646;&#24615;</b>&#65292;&#36825;&#20250;&#26681;&#25454;&#22996;&#25176;&#23646;&#24615;&#30340;&#26144;&#23556;&#20851;&#31995;&#26469;&#20135;&#29983;&#39069;&#22806;&#30340;&#26041;&#27861;&#12290;</p>

<p>&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;Moose &#22312;&#31867;&#30340;&#23454;&#20363;&#20013;&#20197;&#21704;&#24076;&#34920;&#30340;&#26041;&#24335;&#23384;&#20648;&#23646;&#24615;&#65292;&#20294;&#26159;&#36825;&#20010;&#36807;&#31243;&#23545;&#31243;&#24207;&#21592;&#26159;<i>&#19981;&#21487;&#35265;</i>&#30340;&#12290;&#26368;&#22909;&#36890;&#36807;&#26126;&#30830;&#23450;&#20041;&#30340;&#23384;&#21462;&#26041;&#27861;&#26469;&#35775;&#38382;&#36825;&#20123;&#34;&#19981;&#36879;&#26126;&#34;&#30340;&#23646;&#24615;&#12290;</p>

<p>&#23646;&#24615;&#26159;&#31867;&#30340;&#25104;&#21592;&#12290;&#27604;&#22914;&#65292;People &#26377; first name &#21644; last name&#65292; User &#26377; password &#21644;&#19978;&#27425;&#30331;&#24405;&#30340;datetime&#12290;</p>

<pre>  has &#39;first_name&#39; =&#62; (
      is  =&#62; &#39;rw&#39;,
      isa =&#62; &#39;Str&#39;,
  );</pre>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Method"
>Method</a></h2>

<p>&#22312;&#31867;&#20013;&#23450;&#20041;&#30340;&#23376;&#20989;&#25968;&#23601;&#26159;&#31867;&#30340;&#26041;&#27861;&#12290;</p>

<p>&#26041;&#27861;&#23545;&#24212;&#30340;&#34892;&#20026;&#65292;&#23601;&#26159;&#20320;&#30340;&#23545;&#35937;&#35201;&#20570;&#30340;&#20107;&#24773;&#12290;&#27604;&#22914;&#65292;&#19968;&#20010; User &#21487;&#20197;&#30331;&#24405;&#12290;</p>

<pre>  sub login { ... }</pre>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Role"
>Role</a></h2>

<p>&#35282;&#33394;&#26159;&#29992;&#26469;&#23450;&#20041;&#31867;&#25152;&#25198;&#28436;&#30340;&#35282;&#33394;&#12290;&#27604;&#22914;&#65292;Machine &#31867;&#21644; Bone &#31867;&#37117;&#20855;&#26377;&#19981;&#26131;&#30862;&#31561;&#29305;&#24615;&#12290;&#25152;&#20197;&#65292;&#35282;&#33394;&#23601;&#26159;&#29992;&#26469;&#23450;&#20041;&#19968;&#20123;&#36328;&#22810;&#20010;&#19981;&#30456;&#20851;&#30340;&#31867;&#30340;&#20849;&#21516;&#29305;&#24615;&#30340;&#12290;</p>

<p>&#19968;&#20010;&#35282;&#33394;<i>&#26377;</i>&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;<b>&#23646;&#24615;</b>&#12290;</p>

<p>&#19968;&#20010;&#35282;&#33394;<i>&#26377;</i>&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;<b>&#26041;&#27861;</b>&#12290;</p>

<p>&#19968;&#20010;&#35282;&#33394;<i>&#26377;</i>&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;<b>&#26041;&#27861;&#20462;&#39280;&#31526;</b>&#12290;</p>

<p>&#19968;&#20010;&#35282;&#33394;<i>&#26377;</i>&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;<b>&#25152;&#38656;&#26041;&#27861;</b>&#65288;required methods&#65289;&#12290;</p>

<p>&#25152;&#38656;&#26041;&#27861;&#19981;&#26159;&#22312;&#35282;&#33394;&#20013;&#35814;&#32454;&#23450;&#20041;&#30340;&#12290;&#25152;&#38656;&#26041;&#27861;&#26159;&#25152;&#35201;&#20805;&#24403;&#35813;&#35282;&#33394;&#30340;&#31867;&#25152;&#24517;&#39035;&#37325;&#36733;&#30340;&#26041;&#27861;&#12290;</p>

<p>&#19968;&#20010;&#35282;&#33394;<i>&#26377;</i>&#38646;&#20010;&#25110;&#38646;&#20010;&#20197;&#19978;&#30340;<b>&#25490;&#38500;&#35282;&#33394;</b>&#65288;excluded roles&#65289;&#12290;</p>

<p>&#25490;&#38500;&#35282;&#33394;&#26159;&#34920;&#26126;&#20805;&#24403;&#35813;&#35282;&#33394;&#30340;&#31867;&#19981;&#33021;&#21516;&#26102;&#20805;&#24403;&#30340;&#35282;&#33394;&#12290;</p>

<p>&#24403;&#19968;&#20010;&#31867;&#20805;&#24403;&#19968;&#20010;&#35282;&#33394;&#26102;&#65292;&#35282;&#33394;&#30340;&#23646;&#24615;&#21644;&#26041;&#27861;&#25104;&#20026;&#31867;&#30340;&#23646;&#24615;&#21644;&#26041;&#27861;&#12290;&#65288;&#36825;&#37324;&#19981;&#22909;&#32763;&#35793;&#65289;&#12290;</p>

<p>&#35282;&#33394;&#23601;&#22909;&#20687;&#20854;&#20182;&#38754;&#21521;&#23545;&#35937;&#30340;&#35821;&#35328;&#20013;&#30340;&#25509;&#21475;&#36825;&#19968;&#27010;&#24565;&#12290;</p>

<pre>  package Breakable;

  use Moose::Role;

  requires &#39;break&#39;;

  has &#39;is_broken&#39; =&#62; (
      is  =&#62; &#39;rw&#39;,
      isa =&#62; &#39;Bool&#39;,
  );

  after &#39;break&#39; =&#62; sub {
      my $self = shift;

      $self-&#62;is_broken(1);
  };</pre>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Method_modifiers"
>Method modifiers</a></h2>

<p><b>&#26041;&#27861;&#20462;&#39280;&#31526;</b>&#26159;&#22312;&#19968;&#20010;&#29305;&#23450;&#30340;&#20989;&#25968;&#34987;&#25191;&#34892;&#26102;&#30340;&#19968;&#20010;&#38057;&#23376;&#12290;&#27604;&#22914;&#65292;&#20320;&#21487;&#20197;&#36825;&#26679;&#23450;&#20041;&#19968;&#20010;&#26041;&#27861;&#20462;&#39280;&#31526;&#65292;&#34;&#22312;&#25191;&#34892;<code>login()</code>&#21069;&#65292;&#20808;&#25191;&#34892;&#36825;&#27573;&#20195;&#30721;&#34;&#12290;&#24120;&#29992;&#30340;&#20462;&#39280;&#31526;&#26377;&#34;before&#34;&#65292;&#34;after&#34;&#65292;&#34;around&#34;&#65292;&#34;augment&#34;&#12290;&#20320;&#21487;&#20197;&#23545;&#19968;&#20010;&#26041;&#27861;&#32465;&#23450;&#22810;&#20010;&#26041;&#27861;&#20462;&#39280;&#31526;&#12290;</p>

<p>&#26041;&#27861;&#20462;&#39280;&#31526;&#32463;&#24120;&#29992;&#26469;&#37325;&#36733;&#29238;&#31867;&#20013;&#30340;&#26041;&#27861;&#12290;&#26041;&#27861;&#20462;&#39280;&#31526;&#32463;&#24120;&#20986;&#29616;&#22312;&#35282;&#33394;&#20013;&#12290;</p>

<p>&#26412;&#36136;&#19978;&#65292;&#26041;&#27861;&#20462;&#39280;&#31526;&#23601;&#26159;&#26222;&#36890;&#30340; Perl &#31243;&#24207;&#22312;&#21629;&#21517;&#26041;&#27861;&#20043;&#21069;&#25110;&#20043;&#21518;&#35843;&#29992;&#12290;</p>

<pre>  before &#39;login&#39; =&#62; sub {
      my $self = shift;
      my $pw   = shift;

      warn &#34;Called login() with $pw\n&#34;;
  };</pre>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Type"
>Type</a></h2>

<p>Moose &#26377;&#19968;&#20010;&#65288;&#24494;&#22411;&#65289;&#30340;&#31867;&#22411;&#31995;&#32479;&#12290;&#36825;&#20801;&#35768;&#20320;&#20026;&#23646;&#24615;&#23450;&#20041;&#31867;&#22411;&#12290;Moose &#26681;&#25454; Perl &#30340;&#21464;&#37327;&#31867;&#22411;&#26377;&#20869;&#32622;&#31867;&#22411;&#65292;&#22914; <code>Str</code>&#65292;<code>Num</code>&#65292;<code>Bool</code>&#65292;<code>HashRef</code>&#65292;&#31561;&#31561;&#12290;</p>

<p>&#27492;&#22806;&#65292;&#22312;&#20320;&#24212;&#29992;&#31243;&#24207;&#20013;&#30340;&#27599;&#19968;&#20010;&#31867;&#30340;&#21517;&#31216;&#20063;&#21487;&#20197;&#26159;&#19968;&#31181;&#31867;&#22411;&#12290;</p>

<p>&#24403;&#28982;&#65292;&#20320;&#20063;&#21487;&#20197;&#23450;&#20041;&#26377;&#33258;&#24049;&#30340;&#32422;&#26463;&#30340;&#31867;&#22411;&#12290;&#22914;&#65292;&#20320;&#21487;&#20197;&#23450;&#20041;&#27491;&#25968; <code>PosInt</code> &#31867;&#22411;&#12290;</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Delegation"
>Delegation</a></h2>

<p>Moose &#21487;&#20197;&#23450;&#20041;&#22996;&#25176;&#23646;&#24615;&#12290;&#22996;&#25176;&#23646;&#24615;&#20250;&#26681;&#25454;&#30456;&#24212;&#30340;&#26144;&#23556;&#26469;&#35843;&#29992;&#27491;&#30830;&#30340;&#26041;&#27861;&#12290;</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Constructor"
>Constructor</a></h2>

<p>&#26500;&#36896;&#20989;&#25968;&#20026;&#31867;&#26500;&#24314;<b>&#23454;&#20363;</b>&#12290;&#22312;&#26087;&#24335;&#30340; Perl &#35821;&#35328;&#20013;&#65292;&#36825;&#36890;&#24120;&#36890;&#36807;&#35843;&#29992; <code>new()</code> &#26469;&#36820;&#22238;&#19968;&#20010; <code>bless</code> &#21518;&#30340;&#24341;&#29992;&#12290;</p>

<p>&#22312; Moose &#20013;&#65292;<code>new()</code>&#24050;&#32463;&#20026;&#20320;&#20570;&#22909;&#20102;&#25152;&#26377;&#30340;&#20107;&#24773;&#12290;&#20320;&#20174;&#26469;&#19981;&#38656;&#35201;&#33258;&#24049;&#23450;&#20041;&#30456;&#24212;&#30340;&#26500;&#36896;&#20989;&#25968;&#12290;</p>

<p>&#26377;&#20123;&#26102;&#20505;&#20320;&#24819;&#22312;&#23454;&#20363;&#21021;&#22987;&#21270;&#30340;&#26102;&#20505;&#20570;&#19968;&#20123;&#20107;&#24773;&#65292;&#20320;&#21487;&#20197;&#36890;&#36807;&#23450;&#20041; <code>BUILD()</code> &#26041;&#27861;&#26469;&#23454;&#29616;&#65292;Moose &#20250;&#22312;&#26500;&#24314;&#23454;&#20363;&#30340;&#26102;&#20505;&#33258;&#21160;&#20026;&#20320;&#35843;&#29992;&#12290;</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Destructor"
>Destructor</a></h2>

<p>&#24403;&#20320;&#30340;&#23545;&#35937;&#23454;&#20363;&#36229;&#20986;&#33539;&#22260;&#30340;&#26102;&#20505;&#65292;&#36825;&#20010;&#26041;&#27861;&#23558;&#20250;&#33258;&#21160;&#25191;&#34892;&#12290;&#20320;&#21487;&#20197;&#25351;&#23450;&#36825;&#20010;&#26041;&#27861;&#22312;&#32467;&#26463;&#26102;&#20570;&#20160;&#20040;&#65292;&#19981;&#36807;&#36825;&#36890;&#24120;&#26159;&#19981;&#24517;&#35201;&#30340;&#12290;</p>

<p>&#22312;&#26087;&#24335;&#30340; Perl &#20013;&#65292;&#36825;&#20010;&#26159; <code>DESTORY()</code> &#26041;&#27861;&#65292;&#20294;&#22312; Moose &#20013;&#65292;&#36825;&#20010;&#26159; <code>DEMOLISH()</code> &#26041;&#27861;&#12290;</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="Object_instance"
>Object instance</a></h2>

<p>&#23545;&#35937;&#30340;&#23454;&#20363;&#30001;<b>&#26500;&#36896;&#20989;&#25968;</b>&#21019;&#24314;&#12290;&#22914;&#65292;Person &#25110;&#32773; User&#65292;&#30001;&#23427;&#20204;&#30340;<b>constructor</b>&#26469;&#26500;&#24314;&#30340;&#12290;</p>

<p>&#23454;&#20363;&#26377;&#31867;&#30340;&#23646;&#24615;&#12290;&#22914;&#65292;person &#26377; first name &#21644; last name&#12290;</p>

<p>&#22312;&#26087;&#24335;&#30340; Perl 5 &#20013;&#65292;&#36825;&#36890;&#24120;&#36890;&#36807;&#34987;&#32465;&#23450;&#30340;&#21704;&#24076;&#24341;&#29992;&#26469;&#34920;&#31034;&#12290;&#22312; Moose &#20013;&#65292;&#20320;&#19981;&#38656;&#35201;&#30693;&#36947;&#23454;&#20363;&#30340;&#32467;&#26500;&#20855;&#20307;&#26159;&#20160;&#20040;&#26679;&#23376;&#65288;&#34429;&#28982;&#20063;&#26159;&#36890;&#36807;&#21704;&#24076;&#24341;&#29992;&#26469;&#23454;&#29616;&#30340;&#65289;&#12290;</p>

<h2><a class='u' href='#___top' title='click to go to top of document'
name="(24635)(32467)"
>&#24635;&#32467;</a></h2>

<ul>
<li>Class
<p>&#26087;&#24335; Perl OO &#20013;&#65292;&#31867;&#26159;&#19968;&#20010;&#27809;&#26377;&#33258;&#30465;&#26426;&#21046;&#20197;&#21450;&#21508;&#31181;&#31526;&#21495;&#34920;&#30340;&#21253;&#12290;</p>

<p>&#22312; Moose &#20013;&#65292;&#26377;&#33391;&#22909;&#30340;&#33258;&#30465;&#26426;&#21046;&#21644;&#23450;&#20041;&#26684;&#24335;&#12290;</p>
</li>

<li>Attributes
<p>&#26087;&#24335; Perl OO &#20013;&#65292;&#38656;&#35201;&#25163;&#20889;&#23384;&#21462;&#26041;&#27861;&#65292;&#23450;&#20041;&#19968;&#22534;&#31526;&#21495;&#34920;&#65292;&#25110;&#32773;&#20351;&#29992;&#19968;&#20123;&#36741;&#21161;&#27169;&#22359;&#22914; <code>Class::Accessor</code>&#12290;</p>

<p>&#22312; Moose &#20013;&#65292;&#36825;&#20123;&#37117;&#26159;&#22768;&#26126;&#22909;&#30340;&#23450;&#20041;&#65292;&#24182;&#19988;&#19982;&#26041;&#27861;&#19981;&#21516;&#12290;</p>
</li>

<li>Method
<p>&#36825;&#20010;&#19982;&#26087;&#24335;&#30340; Perl OO &#22823;&#33268;&#30456;&#21516;&#12290;</p>
</li>

<li>Roles
<p>&#26087;&#24335; Perl OO &#20013;&#65292;&#36890;&#36807;<code>Class::Trait</code>&#12289;<code>Class::Role</code>&#12289;&#25110;&#32773;<code>mixin.pm</code>&#26469;&#23454;&#29616;&#65311;</p>

<p>&#22312; Moose &#20013;&#65292;&#23427;&#26159; Moose &#26680;&#24515;&#21151;&#33021;&#20043;&#19968;&#12290;</p>
</li>

<li>Method Modifiers
<p>&#26087;&#24335; Perl OO &#20013;&#65292;&#21487;&#33021;&#33021;&#36890;&#36807;&#39640;&#28145;&#30340;&#31526;&#21495;&#34920;&#26469;&#23454;&#29616;&#65292;&#32780;&#19988;&#20320;&#21487;&#33021;&#20174;&#26469;&#37117;&#27809;&#35265;&#36807;&#31867;&#20284;&#30340;&#23454;&#29616;&#65288;&#33267;&#23569;&#22312; Perl 5 &#20197;&#21069;&#27809;&#26377;&#35265;&#36807;&#65289;&#12290;</p>
</li>

<li>Type
<p>&#26087;&#24335; Perl OO &#20013;&#65292;&#36890;&#36807;&#22312;<code>new()</code>&#25110;&#32773;&#30456;&#24212;&#30340;&#35775;&#38382;&#20989;&#25968;&#20013;&#25163;&#21160;&#26816;&#26597;&#31867;&#22411;&#12290;</p>

<p>&#22312; Moose &#20013;&#65292;&#20320;&#22768;&#26126;&#21464;&#37327;&#31867;&#22411;&#65292;&#28982;&#21518;&#36890;&#36807;&#21464;&#37327;&#21517;&#26469;&#20351;&#29992;&#23427;&#20204;&#12290;</p>
</li>

<li>Delegation
<p>&#26087;&#24335; Perl OO &#20013;&#65292;&#36890;&#36807;<code>Class:Delegation</code>&#25110;<code>Class::Delegator</code>&#65292;&#19981;&#36807;&#23454;&#29616;&#36215;&#26469;&#20250;&#27604;&#24819;&#35937;&#20013;&#36824;&#38590;&#12290;</p>

<p>&#22312; Moose &#20013;&#65292;&#36890;&#36807;&#31616;&#21333;&#30340;&#22768;&#26126;&#23601;&#21487;&#20197;&#12290;</p>
</li>

<li>Constructor
<p>&#26087;&#24335; Perl OO &#20013;&#65292;&#36890;&#36807;&#35843;&#29992;&#36127;&#36131;<code>bless</code>&#24341;&#29992;&#30340;<code>new()</code>&#26041;&#27861;&#26469;&#23454;&#29616;&#12290;</p>

<p>&#22312; Moose &#20013;&#65292;&#24050;&#32463;&#40664;&#35748;&#20026;&#20320;&#23454;&#29616;&#12290;</p>
</li>

<li>Destructor
<p>&#26087;&#24335; Perl OO &#20013;&#65292;&#36890;&#36807;&#23450;&#20041;<code>DESTORY()</code>&#26041;&#27861;&#26469;&#23454;&#29616;&#12290;</p>

<p>&#22312; Moose &#20013;&#65292;&#36890;&#36807;&#23450;&#20041;<code>DEMOLISH()</code>&#26469;&#23454;&#29616;&#12290;</p>
</li>

<li>Object Instance
<p>&#26087;&#24335; Perl OO &#20013;&#65292;&#23454;&#20363;&#26159;&#19968;&#20010;&#24050;&#32465;&#23450;&#30340;&#21704;&#24076;&#24341;&#29992;&#12290;</p>

<p>&#22312; Moose &#20013;&#65292;&#36825;&#26159;&#19968;&#20010;&#26377;&#30528;&#19968;&#22534;&#23646;&#24615;&#21644;&#26041;&#27861;&#30340;&#19981;&#36879;&#26126;&#30340;&#19996;&#35199;&#65292;&#19981;&#36807;&#20320;&#21487;&#20197;&#24456;&#26041;&#20415;&#30340;&#20351;&#29992;&#12290;</p>
</li>

<li>Immutabilization
<p>Moose &#25152;&#35859;&#30340;&#34;immutabilization&#34;&#30340;&#21151;&#33021;&#65292;&#25351;&#35753;&#20320;&#30340;&#31867;&#19981;&#21487;&#25913;&#21464;&#65292;&#20043;&#21518;&#30001; Moose &#26469;&#20026;&#20320;&#29983;&#25104;&#19968;&#20123;&#22797;&#26434;&#38590;&#36776;&#21035;&#30340;&#20195;&#30721;&#65292;&#20197;&#21152;&#24555;&#36895;&#24230;&#12290;</p>
</li>
</ul>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="(20160)(20040)(26159)(20803)(31867)(65311)"
>&#20160;&#20040;&#26159;&#20803;&#31867;&#65311;</a></h1>

<p>&#20803;&#31867;&#26159;&#29992;&#26469;&#25551;&#36848;&#31867;&#30340;&#31867;&#12290;&#22312; Moose &#20013;&#65292;&#27599;&#19968;&#20010;&#20320;&#23450;&#20041;&#30340;&#31867;&#37117;&#26377;&#19968;&#20010;<code>meta()</code>&#26041;&#27861;&#12290;<code>meta()</code>&#26041;&#27861;&#36820;&#22238;<a href="../Moose/Meta/Class.html" class="podlinkpod"
>Moose::Meta::Class</a>&#23454;&#20363;&#65292;&#20854;&#20013;&#26377;&#19968;&#20010;&#33258;&#30465;API&#21487;&#20197;&#21578;&#35785;&#20320;&#23427;&#20195;&#34920;&#30340;&#31867;&#12290;</p>

<pre>  my $meta = User-&#62;meta();

  for my $attribute ( $meta-&#62;get_all_attributes ) {
      print $attribute-&#62;name(), &#34;\n&#34;;

      if ( $attribute-&#62;has_type_constraint ) {
          print &#34;  type: &#34;, $attribute-&#62;type_constraint-&#62;name, &#34;\n&#34;;
      }
  }

  for my $method ( $meta-&#62;get_all_methods ) {
      print $method-&#62;name, &#34;\n&#34;;
  }</pre>

<p>&#22522;&#26412;&#19978;&#27599;&#20010;&#25105;&#20204;&#20043;&#21069;&#25152;&#25552;&#21040;&#30340;&#27010;&#24565;&#37117;&#26377;&#20803;&#31867;&#65292;&#25152;&#20197;&#26377;<a href="../Moose/Meta/Class.html" class="podlinkpod"
>Moose::Meta::Class</a>&#65292;<a href="../Moose/Meta/Attribute.html" class="podlinkpod"
>Moose::Meta::Attribute</a>&#65292;<a href="../Moose/Meta/Method.html" class="podlinkpod"
>Moose::Meta::Method</a>&#65292;<a href="../Moose/Meta/Role.html" class="podlinkpod"
>Moose::Meta::Role</a>&#65292;<a href="../Moose/Meta/TypeConstraint.html" class="podlinkpod"
>Moose::Meta::TypeConstraint</a>&#65292;<a href="../Moose/Meta/Instance.html" class="podlinkpod"
>Moose::Meta::Instance</a>&#65292;&#31561;&#31561;&#12290;</p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="BUT_I_NEED_TO_DO_IT_MY_WAY!"
>BUT I NEED TO DO IT MY WAY!</a></h1>

<p>Moose &#26368;&#20255;&#22823;&#30340;&#20107;&#24773;&#23601;&#26159;&#24403;&#20320;&#25366;&#25496; Moose &#30340;&#26412;&#36136;&#26102;&#65292;&#21457;&#29616;&#26377;&#20123;&#20107;&#24773;&#19981;&#26159;&#25353;&#20320;&#25152;&#24819;&#30340;&#36827;&#34892;&#65292;&#37027;&#20040;&#20320;&#21487;&#20197;&#36890;&#36807;&#25193;&#23637;&#20803;&#31867;&#26469;&#20462;&#25913;&#12290;</p>

<p>&#35768;&#22810;&#36825;&#26679;&#30340;&#20195;&#30721;&#24456;&#30701;&#20294;&#26159;&#24456;&#20196;&#20154;&#24778;&#35766;&#65292;&#32780;&#19988;&#19968;&#26086;&#20320;&#20570;&#36807;&#19968;&#27425;&#65292;&#20320;&#23558;&#27704;&#36828;&#19981;&#38656;&#35201;&#37325;&#22797;&#21435;&#20570;&#20102;&#65292;&#21482;&#38656;&#35201;&#31616;&#21333;&#30340;&#21152;&#36733;&#20320;&#30340;&#25299;&#23637;&#23601;&#21487;&#20197;&#20102;&#12290;</p>

<pre>  package MyWay::User;

  use Moose;
  use MooseX::StrictConstructor
  use MooseX::MyWay;

  has ...;</pre>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="(25509)(19979)(26469)(20570)(20160)(20040)(65311)"
>&#25509;&#19979;&#26469;&#20570;&#20160;&#20040;&#65311;</a></h1>

<p>&#24050;&#32463;&#25226; Moose &#20171;&#32461;&#32473;&#20320;&#20102;&#65292;&#25509;&#19979;&#26469;&#23601;&#35813;&#33457;&#26102;&#38388;&#26469;&#23398;&#20064;&#22914;&#20309;&#20351;&#29992;&#20102;&#12290;</p>

<p>&#22914;&#26524;&#20320;&#24819;&#35201;&#30693;&#36947; Moose &#26159;&#22914;&#20309;&#25226;&#20320;&#30340;&#20195;&#30721;&#29992;&#26087;&#24335; Perl 5 OO &#26469;&#23454;&#29616;&#30340;&#65292;&#20320;&#21487;&#20197;&#26597;&#30475;<a href="../Moose/Manual/Unsweetened.html" class="podlinkpod"
>Moose::Manual::Unsweetened</a>&#12290;&#36825;&#20250;&#24110;&#21161;&#20320;&#24555;&#36895;&#30340;&#20102;&#35299;&#34;the Moose way&#34;&#30340;&#12290;</p>

<p>&#20320;&#20063;&#21487;&#20197;&#30452;&#25509;&#36339;&#21040;<a href="../Moose/Manual/Classes.html" class="podlinkpod"
>Moose::Manual::Classes</a>&#26469;&#26597;&#30475;&#21097;&#20313;&#30340;<a href="../Moose/Manual.html" class="podlinkpod"
>Moose::Manual</a>&#12290;</p>

<p>&#22312;&#37027;&#20043;&#21518;&#65292;&#25105;&#20204;&#25512;&#33616;&#20320;&#32487;&#32493;&#30475;<a href="../Moose/Cookbook.html" class="podlinkpod"
>Moose::Cookbook</a>&#12290;&#36825;&#26679;&#20043;&#21518;&#65292;&#30456;&#20449;&#20320;&#20250;&#24456;&#29087;&#24713; Moose &#30340;&#24037;&#20316;&#21407;&#29702;&#20197;&#21450;&#19968;&#20123;&#30456;&#20851;&#38754;&#21521;&#23545;&#35937;&#30340;&#29305;&#24615;&#12290;</p>

<p>&#22312;&#37027;&#20043;&#21518;&#65292;&#22914;&#26524;&#20320;&#20173;&#28982;&#24863;&#20852;&#36259;&#30340;&#35805;&#65292;&#32487;&#32493;&#30475; the Meta and Extending &#20171;&#32461;&#65292;&#36825;&#23545;&#25193;&#23637; Moose &#30340;&#20154;&#26469;&#35828;&#24456;&#26377;&#24110;&#21161;&#12290;</p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="(20316)(32773)"
>&#20316;&#32773;</a></h1>

<p>Moose &#26159;&#30001;&#35768;&#22810;&#24535;&#24895;&#32773;&#20849;&#21516;&#21162;&#21147;&#30340;&#32467;&#26524;&#12290;&#20855;&#20307;&#30340;&#35831;&#21442;&#30475; <a href="../Moose.html#CABAL" class="podlinkpod"
>&#34;CABAL&#34; in Moose</a>&#21644;<a href="../Moose.html#CONTRIBUTORS" class="podlinkpod"
>&#34;CONTRIBUTORS&#34; in Moose</a>&#12290;&#35793;&#32773;:xiaomo(wxm4ever@gmail.com)</p>

<h1><a class='u' href='#___top' title='click to go to top of document'
name="(29256)(26435)(21644)(35768)(21487)"
>&#29256;&#26435;&#21644;&#35768;&#21487;</a></h1>

<p>This software is copyright (c) 2011 by Infinity Interactive, Inc..</p>

<p>&#36825;&#26159;&#33258;&#30001;&#36719;&#20214;&#65292;&#24744;&#21487;&#20197;&#37325;&#26032;&#20998;&#37197;&#25110;&#32773;&#26681;&#25454; Perl 5 &#30340;&#32534;&#31243;&#35821;&#35328;&#31995;&#32479;&#26412;&#36523;&#30456;&#21516;&#30340;&#26465;&#27454;&#36827;&#34892;&#20462;&#25913;&#12290;</p>
<p class="backlinkbottom"><b><a name="___bottom" href="../index.html" title="All Documents">&lt;&lt;</a></b></p>

<!-- end doc -->

</body></html>
